OF500/waveFloatingObject/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

X0    -1;
X1     2;
Y0     0;
Y1     1;
Z0  -0.5;
Z1     1;

nx  40;
ny  20;
nz  45;

vertices
(
    ($X0 $Y0 $Z0)
    ($X1 $Y0 $Z0)
    ($X1 $Y1 $Z0)
    ($X0 $Y1 $Z0)
    ($X0 $Y0 $Z1)
    ($X1 $Y0 $Z1)
    ($X1 $Y1 $Z1)
    ($X0 $Y1 $Z1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    floatingObject
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
